Section 8: More About Strings/Section 8.tex
% Created 2021-08-03 Tue 19:16
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Mohammed Asir Shahid}
\date{2021-08-03}
\title{Section 8\\\medskip
\large More About Strings}
\hypersetup{
 pdfauthor={Mohammed Asir Shahid},
 pdftitle={Section 8},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Advanced String Syntax}
\label{sec:org0ee538d}

Text is one of the most common forms of data that we will work with.

How do we add quotes and apostrophes in Python Strings?

\subsection{Escape Characters}
\label{sec:orga8abf9a}

\begin{verbatim}

print("Hello")
print('That is Alice\'s cat')
print('Say hi to Bob\'s mother')

\end{verbatim}

\begin{verbatim}
Hello
That is Alice's cat
Say hi to Bob's mother
\end{verbatim}



We can have several different types of escape characters.
\begin{enumerate}
\item $\backslash$' - Prints as Single quote
\item $\backslash$`` - Prints as Double quote
\item \t - Prints as tab
\item \n - Prints as newline
\item $\backslash$\ - Prints as backslash.
\end{enumerate}

\begin{verbatim}

print("Hello there!\nHow are you?\nI\'m fine")

\end{verbatim}

\begin{verbatim}
Hello there!
How are you?
I'm fine
\end{verbatim}

\subsection{Raw Strings}
\label{sec:org70e359b}

We can also have raw strings which should be used when we have text that includes many backslashes that we don't want to use for escape characters. There are similar to regular strings, but have ``r'' right at the beginning.

\begin{verbatim}

print(r"Hello")
print(r"That is Carol\'s cat.")

\end{verbatim}

\begin{verbatim}
Hello
That is Carol\'s cat.
\end{verbatim}

\subsection{Multiline Strings with Triple Quotes}
\label{sec:org60833ff}

Instead of using \n in order to put a newline in the string, it can be easier to use multiline strings.

\begin{verbatim}

print("""Dear Alice,
Eve's cat has been arrested for catnapping, cat burgularly, and extortion.
Sincerly,
Bob""")

\end{verbatim}

\begin{verbatim}
Dear Alice,
Eve's cat has been arrested for catnapping, cat burgularly, and extortion.
Sincerly,
Bob
\end{verbatim}


Above, Python automatically formats this using \n and \t in the background.

\subsection{Similarities Between Strings and Lists}
\label{sec:org0e2a636}

Strings can use indices and slices similar to lists. The string ``Hello'' can be seen as a list with 5 items, each of which are individual strings.

\begin{verbatim}

spam="Hello world!"

print(spam[0])
print(spam[1:5])
print(spam[-1])

print("Hello" in spam)
print("x" in spam)
print("HELLO" in spam)

\end{verbatim}

\begin{verbatim}
H
ello
!
True
False
False
\end{verbatim}

\section{String Methods}
\label{sec:orgf363c83}

Unlike list methods, string methods return a new string value rather than modifying the existing string in place. This is due to the fact that strings are immutable.

\subsection{upper(), lower()}
\label{sec:org8cd3458}


\begin{verbatim}

spam="Hello world!"

spam.upper()

print(spam)

spam=spam.upper()

print(spam)

spam=spam.lower()

print(spam)


\end{verbatim}

\begin{verbatim}
Hello world!
HELLO WORLD!
hello world!
\end{verbatim}


This can be helpful when we allow the user to input an answer and we do not care about uppercase or lowercase. There is also a corresponding title() method.

\subsection{isupper(), islower()}
\label{sec:orgad697a6}

These methods return a boolean value depending on whether the strings are uppercase or lowercase. If we have a blank string or a string without any uppercase or lowercase characters, both isupper() and islower() will be false.

\begin{verbatim}

spam="Hello world"

print(spam.islower())

spam="hello world"

print(spam.islower())

spam="HELLO WORLD"

print(spam.isupper())

\end{verbatim}

\begin{verbatim}
False
True
True
\end{verbatim}


We can also call both upper() and isupper() on the same string.

\begin{verbatim}

print("Hello".upper().isupper())

\end{verbatim}

\begin{verbatim}
True
\end{verbatim}

\subsection{The isX() methods}
\label{sec:org612afbe}

There are several other string methods that begin with is and return a boolean.

\begin{enumerate}
\item isalpha() Returns True if the string consists only of letters and isn’t blank

\item isalnum() Returns True if the string consists only of letters and numbers and is not blank

\item isdecimal() Returns True if the string consists only of numeric characters and is not blank

\item isspace() Returns True if the string consists only of spaces, tabs, and newlines and is not blank

\item istitle() Returns True if the string consists only of words that begin with an uppercase letter followed by only lowercase letters
\end{enumerate}



\begin{verbatim}

print("hello".isalpha())
print("hello123".isalnum())
print("123".isdecimal())
print("    ".isspace())
print("Hello world!".isspace())
print("Hello world!"[5].isspace())
print("This Is Title Case!".istitle())

\end{verbatim}

\begin{verbatim}
True
True
True
True
False
True
True
\end{verbatim}

\subsection{startswith(), endswith()}
\label{sec:org7df2434}

These return true if the string value that they are called on begins or ends, respectively, with the string that is passed to the method.

\begin{verbatim}

print("Hello world!".startswith("Hello"))
print("Hello world!".startswith("h"))
print("Hello world!".startswith("ello"))

print("Hello world!".endswith("world!"))
print("Hello world!".endswith("world"))
print("Hello world!".endswith("!"))
\end{verbatim}

\begin{verbatim}
True
False
False
True
False
True
\end{verbatim}

\subsection{join() and split()}
\label{sec:org61e99ae}

The join() method is useful when we have a list of strings that need to be joined together into a single string value. It gets passed a list of strings and returns a string.

\begin{verbatim}

print(",".join(["cats","rats","bats"]))

print("".join(["cats","rats","bats"]))

print(" ".join(["cats","rats","bats"]))

print("\n\n".join(["cats","rats","bats"]))

\end{verbatim}

\begin{verbatim}
cats,rats,bats
catsratsbats
cats rats bats
cats

rats

bats
\end{verbatim}


The split method does the opposite. It is called on a string value and returns a list of strings.

\begin{verbatim}

print("My name is Simon".split())

print("My name is Simon".split("m"))

print("My name is Simon".split("!"))

\end{verbatim}

\begin{verbatim}
['My', 'name', 'is', 'Simon']
['My na', 'e is Si', 'on']
['My name is Simon']
\end{verbatim}

\subsection{rjust(), ljsut(), center()}
\label{sec:org57af876}

rjust() and ljust() return a padded version of the string they are called upon in order to either right or left justify the string. They take an argument that dictates the character length of the justification. We can also give an argument to change the character that is used for the justification.

The center method works similarly, but it centers the text instead of justifying to the right or left.

\begin{verbatim}

print("Hello".rjust(10))
print("Hello".rjust(30))
print("Hello".ljust(10))

print("Hello".rjust(20, "*"))
print("Hello".ljust(10, "-"))

print("Hello".center(20))
print("Hello".center(20,"*"))
print("Hello".center(20,"="))
\end{verbatim}

\begin{verbatim}
     Hello
                         Hello
Hello     
***************Hello
Hello-----
       Hello        
*******Hello********
=======Hello========
\end{verbatim}

\subsection{strip(), rstrip(), lstrip()}
\label{sec:orgaa2eeb4}

These methods can be used when we want to strip off whitespace characters like spaces, tabs, or new lines from the right side, left side, or both sides. We can also pass a string that we want to remove instead of just the whitespace.

\begin{verbatim}

spam="Hello".rjust(10)

print(spam)

spam=spam.strip()

print(spam)

print("   x    ".strip())
print("   x    ".rstrip())
print("   x    ".lstrip())


spam="SpamSpamBaconSpamEggsSpamSpam"

print(spam.strip("amSp"))

\end{verbatim}

\begin{verbatim}
     Hello
Hello
x
   x
x    
BaconSpamEggs
\end{verbatim}

\subsection{replace()}
\label{sec:org93be50a}

This method looks for two arguments, a string to look for and a string to replace it with.

\begin{verbatim}

spam="Hello there!"

print(spam)

spam.replace("e","XYZ")

print(spam)

\end{verbatim}

\begin{verbatim}
Hello there!
Hello there!
\end{verbatim}

\subsection{The pyperclip Module}
\label{sec:org421a637}

We installed this in a previous section. It comes with copy and paste functions that lets it read and write to your computer's clipboard.

\begin{verbatim}

pip install pyperclip

\end{verbatim}


\begin{verbatim}

import pyperclip

#pyperclip.copy("Hello!!!!!!")
#pyperclip.paste("Hello!!!!!!")

\end{verbatim}

\section{String Formatting}
\label{sec:org13b5d5d}

Often times when we want to combine strings to form a single string, we use the plus operator. However, this can get complicated when we have long strings with a lot of variables. Python has string formatting techniques that make this easier.

\begin{verbatim}

name = "Alice"
place = "Main Street"
time = "6 pm"
food = "turnips"

print("Hello " + name + ", you are invited to a party at " + place + " at " + time + ". Please bring " + food + ".")

print("Hello %s, you are invited to a party at %s at %s. Please bring %s." % (name, place, time, food))

\end{verbatim}

\begin{verbatim}
Hello Alice, you are invited to a party at Main Street at 6 pm. Please bring turnips.
Hello Alice, you are invited to a party at Main Street at 6 pm. Please bring turnips.
\end{verbatim}
\end{document}
